# Розширина регресія
from colorama import Fore
import numpy as np
import statsmodels.api as sm

# print(f"даємо та трансформуємо дані")
y = [4.50, 5.15, 6.00, 5.55, 5.70, 6.55, 5.90, 6.15, 6.95, 6.40, 6.90, 7.35, 7.80, 8.00, 8.80, 9.30]

x = [
    [41.8, 7.2, 35.5], [44.6, 9.2, 34.4], [42.0, 11.6, 30.5], [49.3, 13.4, 40.1], [48.6, 13.4, 32.1],
    [54.2, 14.8, 39.2], [62.2, 15.40, 35.1], [57.3, 15.8, 39.3], [54.1, 16.2, 39.2], [69.4, 16.5, 41.1],
    [60.2, 17.0, 42.5], [65.2, 17.1, 45.2], [70.1, 18.0, 45.8], [75.5, 18.5, 43.9], [74.9, 19.0, 50.5],
    [72.3, 20.5, 48.3],
]

x, y = np.array(x), np.array(y)

x = sm.add_constant(x)
print(f"X = \n{x}")
print(f"Y = \n{y}")

# print("Створення самої моделі:")
model = sm.OLS(y, x)
results = model.fit()

# Regression
print(Fore.white, f"Regression (Регресія) як в Exel:"
                   f"\n{results.summary()}")